// 12. Сформируйте массив из 10 значений prompt. Выведите числа из массива, начинающиеся на 1, 2
//  или 5.
//  Метод: Используйтециклfor.
//  Входные: [10, 20, 30, 50, 235, 3000] → Результат: [10, 20, 50, 235]
//  Входные: [12, 22, 35, 51, 235, 102] → Результат: [12, 22, 51, 235, 102]
//  Входные: [3, 4, 7, 8, 9] → Результат: []



const arr = [10, 20, 30, 50, 235, 3000];
const arr2 =[];

let res =[];

for(let i =0 ;i<arr.length;i++){
    arr2.push(String(arr[i]));

}

for(let i = 0; i<arr2.length;i++){
    if(arr2[i][0] == 1 || arr2[i][0] == 2 || arr2[i][0] == 5){
        res.push(+arr2[i]);
        
    }
}console.log(res);
