// 14. Пользователь вводит натуральное число n. Напишите программу, которая печатает звездный
//  прямоугольник размерами n ×10 несколькими способами.
//  Входные: 2 →Результат:
//  **********
//  **********
//  Входные: 4→Результат:
//  **********
//  **********
//  **********
//  **********
//  Входные: "hello world" → Результат: "Hello World"
//  Входные: 6 →Результат:
//  **********
//  **********
//  **********
//  **********
//  **********
//  **********


let num = '6';
let star = '**********'



for(let i = 0; i<num;i++){
    if(!isNaN(num)){   
        star+=' '
    }console.log(star);
}